Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/include/pio/pic32cz2051ca80208.h
/* ========== PORT definition for SDMMC1 peripheral ========== */
#define PIN_PC28I_SDMMC1_SDCD                      _UINT32_(92)
#define MUX_PC28I_SDMMC1_SDCD                      _UINT32_(8) 
#define PINMUX_PC28I_SDMMC1_SDCD                   ((PIN_PC28I_SDMMC1_SDCD << 16) | MUX_PC28I_SDMMC1_SDCD)
#define PORT_PC28I_SDMMC1_SDCD                     (_UINT32_(1) << 28)

#define PIN_PC30I_SDMMC1_SDCK                      _UINT32_(94)
#define MUX_PC30I_SDMMC1_SDCK                      _UINT32_(8) 
#define PINMUX_PC30I_SDMMC1_SDCK                   ((PIN_PC30I_SDMMC1_SDCK << 16) | MUX_PC30I_SDMMC1_SDCK)
#define PORT_PC30I_SDMMC1_SDCK                     (_UINT32_(1) << 30)

#define PIN_PG03I_SDMMC1_SDCMD                     _UINT32_(195)
#define MUX_PG03I_SDMMC1_SDCMD                     _UINT32_(8) 
#define PINMUX_PG03I_SDMMC1_SDCMD                  ((PIN_PG03I_SDMMC1_SDCMD << 16) | MUX_PG03I_SDMMC1_SDCMD)
#define PORT_PG03I_SDMMC1_SDCMD                    (_UINT32_(1) << 3)

#define PIN_PC31I_SDMMC1_SDDAT0                    _UINT32_(95)
#define MUX_PC31I_SDMMC1_SDDAT0                    _UINT32_(8) 
#define PINMUX_PC31I_SDMMC1_SDDAT0                 ((PIN_PC31I_SDMMC1_SDDAT0 << 16) | MUX_PC31I_SDMMC1_SDDAT0)
#define PORT_PC31I_SDMMC1_SDDAT0                   (_UINT32_(1) << 31)

#define PIN_PG00I_SDMMC1_SDDAT1                    _UINT32_(192)
#define MUX_PG00I_SDMMC1_SDDAT1                    _UINT32_(8) 
#define PINMUX_PG00I_SDMMC1_SDDAT1                 ((PIN_PG00I_SDMMC1_SDDAT1 << 16) | MUX_PG00I_SDMMC1_SDDAT1)
#define PORT_PG00I_SDMMC1_SDDAT1                   (_UINT32_(1) << 0)

#define PIN_PG01I_SDMMC1_SDDAT2                    _UINT32_(193)
#define MUX_PG01I_SDMMC1_SDDAT2                    _UINT32_(8) 
#define PINMUX_PG01I_SDMMC1_SDDAT2                 ((PIN_PG01I_SDMMC1_SDDAT2 << 16) | MUX_PG01I_SDMMC1_SDDAT2)
#define PORT_PG01I_SDMMC1_SDDAT2                   (_UINT32_(1) << 1)

#define PIN_PG02I_SDMMC1_SDDAT3                    _UINT32_(194)
#define MUX_PG02I_SDMMC1_SDDAT3                    _UINT32_(8) 
#define PINMUX_PG02I_SDMMC1_SDDAT3                 ((PIN_PG02I_SDMMC1_SDDAT3 << 16) | MUX_PG02I_SDMMC1_SDDAT3)
#define PORT_PG02I_SDMMC1_SDDAT3                   (_UINT32_(1) << 2)

#define PIN_PC27I_SDMMC1_SDWP                      _UINT32_(91)
#define MUX_PC27I_SDMMC1_SDWP                      _UINT32_(8) 
#define PINMUX_PC27I_SDMMC1_SDWP                   ((PIN_PC27I_SDMMC1_SDWP << 16) | MUX_PC27I_SDMMC1_SDWP)
#define PORT_PC27I_SDMMC1_SDWP                     (_UINT32_(1) << 27)

/* ========== PORT definition for SERCOM0 peripheral ========== */
#define PIN_PC00D_SERCOM0_PAD0                     _UINT32_(64)
#define MUX_PC00D_SERCOM0_PAD0                     _UINT32_(3) 
#define PINMUX_PC00D_SERCOM0_PAD0                  ((PIN_PC00D_SERCOM0_PAD0 << 16) | MUX_PC00D_SERCOM0_PAD0)
#define PORT_PC00D_SERCOM0_PAD0                    (_UINT32_(1) << 0)

#define PIN_PC01D_SERCOM0_PAD1                     _UINT32_(65)
#define MUX_PC01D_SERCOM0_PAD1                     _UINT32_(3) 
#define PINMUX_PC01D_SERCOM0_PAD1                  ((PIN_PC01D_SERCOM0_PAD1 << 16) | MUX_PC01D_SERCOM0_PAD1)
#define PORT_PC01D_SERCOM0_PAD1                    (_UINT32_(1) << 1)

#define PIN_PC02D_SERCOM0_PAD2                     _UINT32_(66)
#define MUX_PC02D_SERCOM0_PAD2                     _UINT32_(3) 
#define PINMUX_PC02D_SERCOM0_PAD2                  ((PIN_PC02D_SERCOM0_PAD2 << 16) | MUX_PC02D_SERCOM0_PAD2)
#define PORT_PC02D_SERCOM0_PAD2                    (_UINT32_(1) << 2)

#define PIN_PC03D_SERCOM0_PAD3                     _UINT32_(67)
#define MUX_PC03D_SERCOM0_PAD3                     _UINT32_(3) 
#define PINMUX_PC03D_SERCOM0_PAD3                  ((PIN_PC03D_SERCOM0_PAD3 << 16) | MUX_PC03D_SERCOM0_PAD3)
#define PORT_PC03D_SERCOM0_PAD3                    (_UINT32_(1) << 3)

/* ========== PORT definition for SERCOM1 peripheral ========== */
#define PIN_PC04D_SERCOM1_PAD0                     _UINT32_(68)
#define MUX_PC04D_SERCOM1_PAD0                     _UINT32_(3) 
#define PINMUX_PC04D_SERCOM1_PAD0                  ((PIN_PC04D_SERCOM1_PAD0 << 16) | MUX_PC04D_SERCOM1_PAD0)
#define PORT_PC04D_SERCOM1_PAD0                    (_UINT32_(1) << 4)

#define PIN_PC20D_SERCOM1_PAD0                     _UINT32_(84)
#define MUX_PC20D_SERCOM1_PAD0                     _UINT32_(3) 
#define PINMUX_PC20D_SERCOM1_PAD0                  ((PIN_PC20D_SERCOM1_PAD0 << 16) | MUX_PC20D_SERCOM1_PAD0)
#define PORT_PC20D_SERCOM1_PAD0                    (_UINT32_(1) << 20)

#define PIN_PC05D_SERCOM1_PAD1                     _UINT32_(69)
#define MUX_PC05D_SERCOM1_PAD1                     _UINT32_(3) 
#define PINMUX_PC05D_SERCOM1_PAD1                  ((PIN_PC05D_SERCOM1_PAD1 << 16) | MUX_PC05D_SERCOM1_PAD1)
#define PORT_PC05D_SERCOM1_PAD1                    (_UINT32_(1) << 5)

#define PIN_PC19D_SERCOM1_PAD1                     _UINT32_(83)
#define MUX_PC19D_SERCOM1_PAD1                     _UINT32_(3) 
#define PINMUX_PC19D_SERCOM1_PAD1                  ((PIN_PC19D_SERCOM1_PAD1 << 16) | MUX_PC19D_SERCOM1_PAD1)
#define PORT_PC19D_SERCOM1_PAD1                    (_UINT32_(1) << 19)

#define PIN_PC06D_SERCOM1_PAD2                     _UINT32_(70)
#define MUX_PC06D_SERCOM1_PAD2                     _UINT32_(3) 
#define PINMUX_PC06D_SERCOM1_PAD2                  ((PIN_PC06D_SERCOM1_PAD2 << 16) | MUX_PC06D_SERCOM1_PAD2)
#define PORT_PC06D_SERCOM1_PAD2                    (_UINT32_(1) << 6)

#define PIN_PC18D_SERCOM1_PAD2                     _UINT32_(82)
#define MUX_PC18D_SERCOM1_PAD2                     _UINT32_(3) 
#define PINMUX_PC18D_SERCOM1_PAD2                  ((PIN_PC18D_SERCOM1_PAD2 << 16) | MUX_PC18D_SERCOM1_PAD2)
#define PORT_PC18D_SERCOM1_PAD2                    (_UINT32_(1) << 18)

#define PIN_PC07D_SERCOM1_PAD3                     _UINT32_(71)
#define MUX_PC07D_SERCOM1_PAD3                     _UINT32_(3) 
#define PINMUX_PC07D_SERCOM1_PAD3                  ((PIN_PC07D_SERCOM1_PAD3 << 16) | MUX_PC07D_SERCOM1_PAD3)
#define PORT_PC07D_SERCOM1_PAD3                    (_UINT32_(1) << 7)

#define PIN_PC17D_SERCOM1_PAD3                     _UINT32_(81)
#define MUX_PC17D_SERCOM1_PAD3                     _UINT32_(3) 
#define PINMUX_PC17D_SERCOM1_PAD3                  ((PIN_PC17D_SERCOM1_PAD3 << 16) | MUX_PC17D_SERCOM1_PAD3)
#define PORT_PC17D_SERCOM1_PAD3                    (_UINT32_(1) << 17)

/* ========== PORT definition for SERCOM2 peripheral ========== */
#define PIN_PC08D_SERCOM2_PAD0                     _UINT32_(72)
#define MUX_PC08D_SERCOM2_PAD0                     _UINT32_(3) 
#define PINMUX_PC08D_SERCOM2_PAD0                  ((PIN_PC08D_SERCOM2_PAD0 << 16) | MUX_PC08D_SERCOM2_PAD0)
#define PORT_PC08D_SERCOM2_PAD0                    (_UINT32_(1) << 8)

